app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", nil]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find(params[:artist_id]) != nil
        @songs = Artist.find(params[:artist_id]).songs
      else
        redirect_to artists_path
      end
    else
      @songs = Song.all